Revit 2016 API
IExportContext.OnDaylightPortal Method
 This method marks the beginning of export of a daylight portal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
void OnDaylightPortal(
	DaylightPortalNode node
)
Visual Basic
Sub OnDaylightPortal ( _
	node As DaylightPortalNode _
)
Visual C++
void OnDaylightPortal(
	DaylightPortalNode^ node
)
Parameters
node
Type: Autodesk.Revit.DB.DaylightPortalNode
 A node describing the daylight portal object.
See Also
IExportContext Interface
Autodesk.Revit.DB Namespace